# SomeDimensionsLostWitnessLines Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..SomeDimensionsLostWitnessLines Property
BuiltInFailures..::..DimensionFailures Class See Also
---
Some Dimensions lost some of their References on paste.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SomeDimensionsLostWitnessLines { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SomeDimensionsLostWitnessLines As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SomeDimensionsLostWitnessLines {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace